&НаСервереБезКонтекста
Функция ПолучитьСсылкуПоПриходу(штрихкод)
    // return the value from the list if the barcode is linked to the order
    ПриходКарта = Справочники.ПриходКарты.НайтиПоНаименованию(штрихкод);
    МНЗ = РегистрСведений.ПриходКартыРозницы.СоздатьНаборЗаписей();
    МНЗ.Отбор.ПриходКарта.Установить(ПриходКарта);
    МНЗ.Прочитать();

    Если МНЗ.Количество() > 0 Тогда
        Возврат МНЗ[0].Документ;
    Иначе
        Возврат Справочники.ПриходКарты.ПустаяСсылка();
    КонецЕсли;

КонецФункции
