&НаКлиенте
// Handler for working with the equipment, receives the recognized barcode from the scanner as input
Процедура ВС_ОбработкаОповещенияВместо(ИмяСобытия, Параметр, Источник)

    ИначеЕсли Источник = "ПодключаемоеОборудование" И ИмяСобытия = "ScanData" И СтрДлина(Параметр[0]) = 13 
    И Лев(Параметр[0], 7) = "2010000" Тогда

        // Check EAN13 mask
        // Check if barcode is in the mask of RetailCardReceipts
        Если ЗначениеЗаполнено(ЭтаФорма.Объект.Ссылка) Тогда // if client order is saved in DB
            ПриходКарта = ПриходКартыПоНаименованию(Параметр[0]); // find barcode by name
            Если ЗначениеЗаполнено(ПриходКарта) Тогда // if found
                ПривязатьКартуКЗаказу(ПриходКарта, ЭтаФорма.Объект.Ссылка); // link to order
                Элемент.ПривязаннаяШтрихкарта.Заголовок = "Штрихкарта: " + ПриходКарта;
            Иначе
                Сообщить("Штрихкарта не зарегистрирована, связь с документом невозможна");
            КонецЕсли;
        Иначе
            Сообщить("Сначала запишите заказ", СтатусСообщения.Внимание);
        КонецЕсли;

    Иначе // if the barcode does not match any known processing list, process standard way
        ОбработатьШтрихкод(МенеджерОборудованияИлиКлиент.ПреборазоватьДанныеСоСканераВМассив(Параметр));
    КонецЕсли;

КонецПроцедуры
