&НаСервереБезКонтекста
Процедура ПривязатьКартуКЗаказу(ПриходКарта, Документ)

    МРС = РегистрСведений.ПриходКартыРозницы.СоздатьМенеджерЗаписи();
    МНЗ = РегистрСведений.ПриходКартыРозницы.СоздатьНаборЗаписей();
    МНЗ.Отбор.ПриходКарта.Установить(ПриходКарта);
    МНЗ.Прочитать();

    Если МНЗ.Количество() > 0 Тогда
        Сообщить("Штрихкарта уже привязана к документу: " + МНЗ[0].Документ, СтатусСообщения.Информация);
        ПриходКарта = Справочники.ПриходКарты.ПустаяСсылка();
        возврат;
    Иначе
        МНЗ = РегистрСведений.ПриходКартыРозницы.СоздатьНаборЗаписей();
        МНЗ.Отбор.Документ.Установить(Документ);
        МНЗ.Прочитать();

        Если МНЗ.Количество() > 0 Тогда
            Сообщить("К данному документу уже привязана другая штрихкарта: " + МНЗ[0].ПриходКарта, СтатусСообщения.Информация);
            ПриходКарта = Справочники.ПриходКарты.ПустаяСсылка();
            возврат;
        КонецЕсли;

        // Add entry to the register only if both the card and the document are not already linked
        МРС.ПриходКарта = ПриходКарта;
        МРС.ПриходКарта = ПриходКарта;
        МРС.Документ = Документ;
        МРС.Статус = "К оплате";
        МРС.Записать();
        Сообщить("Штрихкарта привязана успешно", СтатусСообщения.Информация);
    КонецЕсли;

КонецПроцедуры
