&НаСервере
Функция ПолучитьНаименованиеПривязаннойШтрихкарты()
    // The function checks whether the object is saved in the database and,
    // if yes, then checks for a linked barcode card by the customer order reference
    // It searches for the linked barcode card in the register.
    // Returns either an empty string or the barcode card name.

    Если ЗначениеЗаполнено(Объект.Ссылка) Тогда

        МНЗ = РегистрСведений.ПриходКартыРозницы.СоздатьНаборЗаписей();
        МНЗ.Отбор.Документ.Установить(Объект.Ссылка);
        МНЗ.Прочитать();

        Если МНЗ.Количество() > 1 Тогда
            Сообщить("К данному документу привязано более 1 карты! Это недопустимая ошибка! Свяжитесь с системным администратором!");
            Возврат "";
        ИначеЕсли МНЗ.Количество() > 0 Тогда
            Возврат МНЗ[0].ПриходКарта.Наименование;
        Иначе
            Возврат "";
        КонецЕсли;

    КонецЕсли;
КонецФункции
